nasbarok/desknode/firmware/desknode/sdkconfig.defaults
# DeskNode — configuration de référence du pipeline d'affichage (story dn1-2).
#
# ⚠️ PIÈGE, le plus coûteux du projet : ce fichier n'est lu que pour PRODUIRE
# `sdkconfig`. Si un `sdkconfig` existe déjà (il est gitignoré, donc INVISIBLE à
# `git status`), c'est LUI qui gagne, en silence.
#     Règle du dépôt : toute modification ici se valide par
#         rm sdkconfig && idf.py build
#     puis par la LECTURE du bandeau de boot, pas par la lecture de ce fichier.
#
# Une ligne = une raison. Rien ici n'est un défaut d'ESP-IDF : chaque symbole
# ci-dessous corrige un défaut qui produirait un build « qui compile et qui rame ».

# ── Cible ────────────────────────────────────────────────────────────────────
# Figée en dn1-1 (décision D-B : ESP-IDF v5.5.5, esp32s3 seul).
CONFIG_IDF_TARGET="esp32s3"

# ── Flash ────────────────────────────────────────────────────────────────────
# Défaut IDF = 2MB. La carte en porte 16 : sans cette ligne le bootloader
# annonce 2MB et toute partition au-delà de 0x200000 est inaccessible.
# (Solde l'écart légué par dn1-1.)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Table de partitions maison : 4 MiB d'app + une partition d'assets + une
# partition « stimulus » sacrifiable pour les écritures flash d'AC6.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── PSRAM ────────────────────────────────────────────────────────────────────
# Défaut IDF = n. Sans PSRAM, pas de framebuffer 614 400 o : l'ESP32-S3 n'a que
# ~512 KiB de RAM interne, dont une partie déjà prise.
CONFIG_SPIRAM=y

# Défaut IDF = QUAD. Le module ESP32-S3R8 embarque de la PSRAM OCTALE : en quad
# elle n'est pas détectée du tout (le bandeau de boot le dit).
CONFIG_SPIRAM_MODE_OCT=y

# Défaut IDF = 40M. À 40 MHz la bande passante ne suffit pas au refill DMA de
# l'écran (23,0 Mo/s en continu rien que pour afficher) : l'image scintille.
# ⛔ 120M est INTERDIT ici : le Kconfig d'Espressif prévient qu'un écart de ~20 °C
#    après le boot fait planter les accès PSRAM aléatoirement. DeskNode vit H24
#    sur la façade d'une tour de jeu — l'écart de température est le régime
#    nominal, pas un cas limite. Ce n'est pas une optimisation, c'est une panne
#    programmée. (source : components/esp_psram/esp32s3/Kconfig.spiram)
CONFIG_SPIRAM_SPEED_80M=y

# ── Écran RGB ────────────────────────────────────────────────────────────────
# Défaut IDF = n. Retenu, mais ⚠️ EFFET PROPRE NON MESURÉ : conservé PAR
# PRÉCAUTION, parce que son coût est nul — pas parce qu'un A/B l'a démontré.
# La raison d'origine est RÉFUTÉE : il avait été activé pour que le compteur
# vsync continue de tourner pendant les écritures flash d'AC6. Or le compteur
# est AVEUGLE à ce défaut de toute façon — 37,33 Hz avant le stimulus,
# 37,45 Hz pendant. Il n'y avait rien à y voir.
# La raison de remplacement — « sans lui, le décalage devient partiellement
# irrattrapable » — n'est PAS démontrée non plus : les seules branches mesurées
# avec `ISR_IRAM_SAFE=n` portaient AUSSI un bounce buffer de 19 200 px, donc
# DEUX variables changées à la fois, ce qu'AC6 interdit explicitement (« une
# seule variable à la fois »). La branche « bounce 0, ISR_IRAM_SAFE=n » n'a
# jamais été jouée, ni ici ni ailleurs dans le dépôt.
# Décision owner : on ne re-mesure pas, on garde le symbole, et on écrit ici que
# son effet propre est INCONNU — plutôt que de laisser une justification fausse.
# Contrainte induite, elle bien réelle : le callback vsync doit être IRAM_ATTR
# et ne toucher que de la RAM interne.
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

# Défaut IDF = n. MESURÉ NÉCESSAIRE ICI, le 2026-08-14, sur cette carte.
# SYMPTÔME sans cette ligne : l'image s'affiche avec les BONNES COULEURS mais
# un cadrage décalé EN PERMANENCE — coupée en deux, la partie de droite
# revenant sur la gauche, le carré rouge du coin haut-gauche de la mire se
# retrouvant vers le milieu de la première ligne.
# PREUVE que c'est bien ça : SANS ce symbole, un appel manuel à
# `esp_lcd_rgb_panel_restart()` (commande console `dma`) remet l'image en place
# d'un coup. Le décalage est donc un décrochage de la DMA au démarrage, pas une
# erreur de timings ni de brochage.
# Ce que fait le symbole (Kconfig d'Espressif) : « Reset the GDMA channel every
# VBlank to stop permanent desyncs from happening. Only need to enable it when
# in your application, the DMA can't deliver data as fast as the LCD consumes
# it. » — c'est exactement notre cas : 23,0 Mo/s en continu depuis la PSRAM.
# ⚠️ CONSÉQUENCE, à ne jamais oublier en lisant une observation : ce symbole
#    ACTIVÉ rend la commande `dma` INOPÉRANTE. Dans
#    components/esp_lcd/rgb/esp_lcd_panel_rgb.c:1149-1165,
#    `lcd_rgb_panel_try_restart_transmission()` pose `do_restart = true` sans
#    condition sous `#if CONFIG_LCD_RGB_RESTART_IN_VSYNC`, et ne LIT JAMAIS
#    `panel->flags.need_restart` — le seul bit que `esp_lcd_rgb_panel_restart()`
#    (ligne 464/472) sait poser. Le redémarrage a déjà lieu à chaque VBlank tout
#    seul. Tout « le `dma` a remis l'image » relevé SOUS cette configuration
#    crédite la commande d'un travail qu'elle n'a pas fait.
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# ── Mesure ───────────────────────────────────────────────────────────────────
# Défaut IDF = 100 Hz, soit un tick de 10 ms — plus grossier que la période
# d'une trame (26,7 ms) et que la cadence de bascule d'AC5. À 1000 Hz, un
# vTaskDelay(1) vaut 1 ms et la cadence du stimulus est pilotable.
CONFIG_FREERTOS_HZ=1000

# Défaut IDF = n. AC6 demande de chiffrer le coût de la configuration retenue en
# « PSRAM consommée, temps de boot, CHARGE CPU ». Les deux premiers sont mesurés
# (§5.4 du fichier `hardware/`), la charge CPU ne l'était NULLE PART dans le
# dépôt. Ce symbole arme `vTaskGetRunTimeStats()`, qu'imprime la commande
# console `cpu`. Il sélectionne tout seul FREERTOS_USE_TRACE_FACILITY et
# FREERTOS_USE_STATS_FORMATTING_FUNCTIONS : rien à ajouter pour eux.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# C'est DÉJÀ le défaut du choice, et on l'écrit quand même : l'autre branche
# (CONFIG_FREERTOS_RUN_TIME_STATS_USING_CPU_CLK) compterait des CYCLES et non du
# temps — sa fréquence bouge avec le DFS — et son compteur 32 bits DÉBORDE en
# ~17 s, moins que la fenêtre d'une observation. L'esp_timer tourne à 1 MHz quoi
# qu'il arrive et déborde en ~4 290 s.
# (source : components/freertos/Kconfig, choice FREERTOS_RUN_TIME_STATS_CLK)
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y

# ── XIP depuis la PSRAM — RÉFUTÉ, donc ABSENT ────────────────────────────────
# ⚠️ Ce bloc ne justifie AUCUNE ligne : `CONFIG_SPIRAM_XIP_FROM_PSRAM` est
# DÉLIBÉRÉMENT absent de ce fichier (défaut IDF = n, on le garde à n). Il est
# écrit ici pour qu'on ne le rajoute pas « au cas où » à la prochaine relecture.
#
# SYMPTÔME visé, sous stimulus d'écriture flash (effacement + écriture de
# secteurs de 4 KiB en boucle, ~184 686 o/s soutenus, ~45 secteurs/s) :
# « l'image défile vers la droite EN PERMANENCE ». Ce n'est PAS le
# « scintillement » annoncé par research-paysage.md §4 : c'est un décrochage DMA
# qui se reproduit à chaque secteur et dont le décalage S'ACCUMULE — un défaut
# PERMANENT, pas un papillotement. La description mérite d'être gardée telle
# quelle : c'est elle qui a corrigé la prédiction de la recherche.
#
# VERDICT, mesuré le 2026-08-14 sur cette carte : sous stimulus IDENTIQUE,
# l'image défile EXACTEMENT PAREIL avec XIP et sans XIP. XIP est RÉFUTÉ pour ce
# défaut.
# POURQUOI le mécanisme ne s'applique pas — et la nuance est tout le sujet : la
# PSRAM octale et la flash partagent bien le contrôleur SPI0, mais XIP ne retire
# de la flash que les LECTURES de code et de constantes. Notre stimulus fait des
# ÉCRITURES flash explicites, qui bloquent SPI0 de toute façon, XIP ou pas.
# CE QU'IL AURAIT COÛTÉ pour rien : −342 876 o de PSRAM et +1,6 Ko de binaire.
# ⚠️ Le compteur vsync ne voit RIEN de ce défaut : le contrôleur LCD garde sa
#    cadence même affamé, il sort des pixels périmés. Mesuré : 37,33 Hz avant le
#    stimulus, 37,45 Hz pendant. C'est l'œil qui est l'instrument, pas le fps.
# Il n'existe à ce jour AUCUNE parade logicielle à cette contention : la
# mitigation est architecturale — ne pas écrire en flash pendant l'affichage
# (décision owner D4, pas d'OTA en V1). Détail : §5.3 de
# `hardware/ESP32-S3-Touch-LCD-2.8B-affichage.md`.

# ── Console INTERACTIVE sur l'USB ────────────────────────────────────────────
# Défaut IDF = console primaire sur UART0 (header GPIO43/44), plus une console
# SECONDAIRE sur l'USB-Serial/JTAG — mais celle-ci est en SORTIE SEULE. Or ce
# firmware doit RECEVOIR des commandes (changer de mire, lancer un stimulus,
# rejouer une mesure) sans être reflashé entre chaque observation : un seul
# binaire pour toutes les configurations, sinon on ajoute une variable qu'on ne
# contrôle pas à chaque A/B.
#
# ⚠️ CE QUE ÇA COÛTE, ET C'EST RÉEL : le log ne part plus sur le header UART
#    TX=GPIO43/RX=GPIO44. dn1-1 avait mesuré ce second chemin et le comptait
#    comme voie de secours si le bring-up de l'écran perturbait l'USB. Ici,
#    l'USB devient le chemin UNIQUE.
#    Pour récupérer le header : remplacer cette ligne par
#    `CONFIG_ESP_CONSOLE_UART_DEFAULT=y`, puis `rm sdkconfig && idf.py build`.
#    Ce qu'on récupère : le log repart sur les DEUX chemins (header UART ET USB,
#    via la console secondaire en sortie seule, exactement comme hello-desknode),
#    et la console INTERACTIVE se retrouve sur le header — `dn_console.c` monte
#    un REPL UART par compilation conditionnelle dans cette configuration.
#    Ce qu'on perd : l'USB ne REÇOIT plus les commandes. Il faut un adaptateur
#    USB-série sur TX=GPIO43/RX=GPIO44 (115200) pour taper quoi que ce soit.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ── LVGL (story dn1-3) ───────────────────────────────────────────────────────
# Les symboles CONFIG_LV_… viennent du Kconfig de lvgl/lvgl 9.5.0, tiré par
# main/idf_component.yml. Les trois lignes ci-dessous sont écrites MÊME quand
# elles reprennent le défaut de LVGL : ce sont celles dont un changement casserait
# une propriété MESURÉE du socle, et un défaut amont peut bouger d'une version à
# l'autre sans prévenir.

# C'est DÉJÀ le défaut de LVGL, et on l'écrit quand même : le framebuffer RGB du
# panneau est en RGB565 (dn_display.c : bits_per_pixel = 16) et l'asset Living PCB
# est du RGB565 natif non compressé. Tant que LVGL rend dans le même format, le
# flush est une COPIE ; en 24 ou 32 bits ce serait une CONVERSION par pixel, à
# chaque rafraîchissement partiel. Le budget de la story (§5.4 : 26,7 ms de trame)
# ne le supporterait pas.
CONFIG_LV_COLOR_DEPTH_16=y

# ⚠️ PAS de « swap bytes » : c'est un réglage de bus SPI/I80 (octets envoyés en
# série). Ici les pixels sont lus par la DMA depuis la PSRAM en 16 bits d'un coup,
# dans l'ordre natif little-endian. Le flag `swap_bytes` d'esp_lvgl_port reste
# donc à 0 dans dn_ui.c. Cette ligne n'existe pas : elle est écrite pour qu'on ne
# l'ajoute pas « par symétrie avec les exemples SPI ».

# Défaut LVGL = 14, illisible sur 480x640 à ~50 cm. 28 est la taille du label
# vivant d'AC2 ; elle porte aussi l'observation « textes fins clairs violets »
# héritée de dn1-2, qui demande des jambages FINS et ANTIALIASÉS pour se rejouer.
CONFIG_LV_FONT_MONTSERRAT_28=y

# ⚠️ CONFIG_LV_USE_PERF_MONITOR est DÉLIBÉRÉMENT ABSENT (défaut n, gardé à n).
# Il dessine un encart fps/CPU EN PERMANENCE dans un coin de l'écran : il
# INVALIDERAIT une zone à chaque cycle de rafraîchissement, donc il fabriquerait
# lui-même le trafic de flush qu'AC3 est censé mesurer. L'instrument serait le
# stimulus. La mesure passe par les compteurs de `dn_ui.c` (commande `flush`),
# qui n'affichent rien à l'écran.

# ⚠️ Le tas de LVGL (`lv_malloc`) reste sur l'implémentation intégrée
# (CONFIG_LV_USE_BUILTIN_MALLOC=y, défaut) : 64 Ko RÉSERVÉS EN STATIQUE dans le
# .bss de la RAM interne. Conséquence à ne pas se cacher pour AC8 : ce coût-là est
# INVISIBLE à un avant/après `heap_caps_get_free_size()`, puisqu'il est déjà
# prélevé au link. C'est pour ça que la commande `ui` imprime `lv_mem_monitor()` :
# c'est le seul instrument qui dise ce que LVGL consomme RÉELLEMENT dans ces
# 64 Ko. Ne pas remplacer par LV_USE_CLIB_MALLOC sans re-mesurer les deux.

# ── Confort de diagnostic ────────────────────────────────────────────────────
# Le bring-up RGB panique (accès cache, DMA affamée). Un backtrace symbolisé
# vaut une heure de tâtonnement ; `idf.py monitor` fait la symbolisation via
# l'ELF, encore faut-il que le panic HANDLER s'affiche plutôt que de rebooter.
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y
